TEAM-RD0105/MasterProject/MasterModel/RD0105FirmwareModel_Config/RTD/include/S32K37_DSPI_MSC_WRAPPER.h
/*==================================================================================================
*   Project              : RTD AUTOSAR 4.7
*   Platform             : CORTEXM
*   Peripheral           : LPSPI
*   Dependencies         : 
*
*   Autosar Version      : 4.7.0
*   Autosar Revision     : ASR_REL_4_7_REV_0000
*   Autosar Conf.Variant :
*   SW Version           : 6.0.0
*   Build Version        : S32K3_RTD_6_0_0_D2506_ASR_REL_4_7_REV_0000_20250610
*
*   Copyright 2020 - 2025 NXP
*
*   NXP Confidential and Proprietary. This software is owned or controlled by NXP and may only be
*   used strictly in accordance with the applicable license terms. By expressly
*   accepting such terms or by downloading, installing, activating and/or otherwise
*   using the software, you are agreeing that you have read, and that you agree to
*   comply with and are bound by, such license terms. If you do not agree to be
*   bound by the applicable license terms, then you may not retain, install,
*   activate or otherwise use the software.
==================================================================================================*/

#ifndef S32K37_DSPI_MSC_WRAPPER_H
#define S32K37_DSPI_MSC_WRAPPER_H

/**
*   @file    S32K37_DSPI_MSC_WRAPPER.h
*
*   @brief   DSPI IP driver types header file.
*   @details DSPI IP driver types header file.

*   @addtogroup DSPI_DRIVER Dspi Driver
*   @{
*/

#ifdef __cplusplus
extern "C"{
#endif


/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "S32K37_DSPI_MSC.h"

/*==================================================================================================
*                                 SOURCE FILE VERSION INFORMATION
==================================================================================================*/

/*==================================================================================================
*                                       FILE VERSION CHECKS
==================================================================================================*/

/*==================================================================================================
*                                            CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                       DEFINES AND MACROS
==================================================================================================*/

/* ----------------------------------------------------------------------------
   -- DSPI_MSC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPI_MSC_Peripheral_Access_Layer DSPI_MSC Peripheral Access Layer
 * @{
 */

/** DSPI_MSC - Size of Registers Arrays */
#define DSPI_MODE_CTAR_CTAR_COUNT             DSPI_MSC_MODE_CTAR_CTAR_COUNT
#define DSPI_TXFR_COUNT                       DSPI_MSC_TXFR_COUNT
#define DSPI_RXFR_COUNT                       DSPI_MSC_RXFR_COUNT
#define DSPI_CTARE_COUNT                      DSPI_MSC_CTARE_COUNT

/** DSPI_MSC - Register Layout Typedef */
typedef DSPI_MSC_Type DSPI_Type;
typedef DSPI_MSC_MemMapPtr DSPI_MemMapPtr;

/** Number of instances of the DSPI_MSC module. */
#define DSPI_INSTANCE_COUNT                  DSPI_MSC_INSTANCE_COUNT

/* DSPI_MSC - Peripheral instance base addresses */
/** Peripheral DSPI_MSC base address */
#define IP_DSPI_BASE                         IP_DSPI_MSC_BASE
/** Peripheral DSPI_MSC base pointer */
#define IP_DSPI                              IP_DSPI_MSC
/** Array initializer of DSPI_MSC peripheral base addresses */
#define IP_DSPI_BASE_ADDRS                   IP_DSPI_MSC_BASE_ADDRS
/** Array initializer of DSPI_MSC peripheral base pointers */
#define IP_DSPI_BASE_PTRS                    IP_DSPI_MSC_BASE_PTRS

/* ----------------------------------------------------------------------------
   -- DSPI_MSC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DSPI_MSC_Register_Masks DSPI_MSC Register Masks
 * @{
 */

/*! @name MCR - Module Configuration Register */
/*! @{ */

#define DSPI_MCR_HALT_MASK                   DSPI_MSC_MCR_HALT_MASK
#define DSPI_MCR_HALT_SHIFT                  DSPI_MSC_MCR_HALT_SHIFT
#define DSPI_MCR_HALT_WIDTH                  DSPI_MSC_MCR_HALT_WIDTH
#define DSPI_MCR_HALT(x)                     DSPI_MSC_MCR_HALT(x)

#define DSPI_MCR_PES_MASK                    DSPI_MSC_MCR_PES_MASK
#define DSPI_MCR_PES_SHIFT                   DSPI_MSC_MCR_PES_SHIFT
#define DSPI_MCR_PES_WIDTH                   DSPI_MSC_MCR_PES_WIDTH
#define DSPI_MCR_PES(x)                      DSPI_MSC_MCR_PES(x)

#define DSPI_MCR_XSPI_MASK                   DSPI_MSC_MCR_XSPI_MASK
#define DSPI_MCR_XSPI_SHIFT                  DSPI_MSC_MCR_XSPI_SHIFT
#define DSPI_MCR_XSPI_WIDTH                  DSPI_MSC_MCR_XSPI_WIDTH
#define DSPI_MCR_XSPI(x)                     DSPI_MSC_MCR_XSPI(x)

#define DSPI_MCR_CLR_RXF_MASK                DSPI_MSC_MCR_CLR_RXF_MASK
#define DSPI_MCR_CLR_RXF_SHIFT               DSPI_MSC_MCR_CLR_RXF_SHIFT
#define DSPI_MCR_CLR_RXF_WIDTH               DSPI_MSC_MCR_CLR_RXF_WIDTH
#define DSPI_MCR_CLR_RXF(x)                  DSPI_MSC_MCR_CLR_RXF(x)

#define DSPI_MCR_CLR_TXF_MASK                DSPI_MSC_MCR_CLR_TXF_MASK
#define DSPI_MCR_CLR_TXF_SHIFT               DSPI_MSC_MCR_CLR_TXF_SHIFT
#define DSPI_MCR_CLR_TXF_WIDTH               DSPI_MSC_MCR_CLR_TXF_WIDTH
#define DSPI_MCR_CLR_TXF(x)                  DSPI_MSC_MCR_CLR_TXF(x)

#define DSPI_MCR_DIS_RXF_MASK                DSPI_MSC_MCR_DIS_RXF_MASK
#define DSPI_MCR_DIS_RXF_SHIFT               DSPI_MSC_MCR_DIS_RXF_SHIFT
#define DSPI_MCR_DIS_RXF_WIDTH               DSPI_MSC_MCR_DIS_RXF_WIDTH
#define DSPI_MCR_DIS_RXF(x)                  DSPI_MSC_MCR_DIS_RXF(x)

