TEAM-RD0105/MasterProject/MasterModel/RD0105FirmwareModel_Config/RTD/include/S32K37_DSPI_MSC_WRAPPER.h
#define DSPI_SR_TXCTR_MASK                   DSPI_MSC_SR_TXCTR_MASK
#define DSPI_SR_TXCTR_SHIFT                  DSPI_MSC_SR_TXCTR_SHIFT
#define DSPI_SR_TXCTR_WIDTH                  DSPI_MSC_SR_TXCTR_WIDTH
#define DSPI_SR_TXCTR(x)                     DSPI_MSC_SR_TXCTR(x)

#define DSPI_SR_CMDFFF_MASK                  DSPI_MSC_SR_CMDFFF_MASK
#define DSPI_SR_CMDFFF_SHIFT                 DSPI_MSC_SR_CMDFFF_SHIFT
#define DSPI_SR_CMDFFF_WIDTH                 DSPI_MSC_SR_CMDFFF_WIDTH
#define DSPI_SR_CMDFFF(x)                    DSPI_MSC_SR_CMDFFF(x)

#define DSPI_SR_RFDF_MASK                    DSPI_MSC_SR_RFDF_MASK
#define DSPI_SR_RFDF_SHIFT                   DSPI_MSC_SR_RFDF_SHIFT
#define DSPI_SR_RFDF_WIDTH                   DSPI_MSC_SR_RFDF_WIDTH
#define DSPI_SR_RFDF(x)                      DSPI_MSC_SR_RFDF(x)

#define DSPI_SR_TFIWF_MASK                   DSPI_MSC_SR_TFIWF_MASK
#define DSPI_SR_TFIWF_SHIFT                  DSPI_MSC_SR_TFIWF_SHIFT
#define DSPI_SR_TFIWF_WIDTH                  DSPI_MSC_SR_TFIWF_WIDTH
#define DSPI_SR_TFIWF(x)                     DSPI_MSC_SR_TFIWF(x)

#define DSPI_SR_RFOF_MASK                    DSPI_MSC_SR_RFOF_MASK
#define DSPI_SR_RFOF_SHIFT                   DSPI_MSC_SR_RFOF_SHIFT
#define DSPI_SR_RFOF_WIDTH                   DSPI_MSC_SR_RFOF_WIDTH
#define DSPI_SR_RFOF(x)                      DSPI_MSC_SR_RFOF(x)

#define DSPI_SR_DDIF_MASK                    DSPI_MSC_SR_DDIF_MASK
#define DSPI_SR_DDIF_SHIFT                   DSPI_MSC_SR_DDIF_SHIFT
#define DSPI_SR_DDIF_WIDTH                   DSPI_MSC_SR_DDIF_WIDTH
#define DSPI_SR_DDIF(x)                      DSPI_MSC_SR_DDIF(x)

#define DSPI_SR_SPEF_MASK                    DSPI_MSC_SR_SPEF_MASK
#define DSPI_SR_SPEF_SHIFT                   DSPI_MSC_SR_SPEF_SHIFT
#define DSPI_SR_SPEF_WIDTH                   DSPI_MSC_SR_SPEF_WIDTH
#define DSPI_SR_SPEF(x)                      DSPI_MSC_SR_SPEF(x)

#define DSPI_SR_DPEF_MASK                    DSPI_MSC_SR_DPEF_MASK
#define DSPI_SR_DPEF_SHIFT                   DSPI_MSC_SR_DPEF_SHIFT
#define DSPI_SR_DPEF_WIDTH                   DSPI_MSC_SR_DPEF_WIDTH
#define DSPI_SR_DPEF(x)                      DSPI_MSC_SR_DPEF(x)

#define DSPI_SR_CMDTCF_MASK                  DSPI_MSC_SR_CMDTCF_MASK
#define DSPI_SR_CMDTCF_SHIFT                 DSPI_MSC_SR_CMDTCF_SHIFT
#define DSPI_SR_CMDTCF_WIDTH                 DSPI_MSC_SR_CMDTCF_WIDTH
#define DSPI_SR_CMDTCF(x)                    DSPI_MSC_SR_CMDTCF(x)

#define DSPI_SR_BSYF_MASK                    DSPI_MSC_SR_BSYF_MASK
#define DSPI_SR_BSYF_SHIFT                   DSPI_MSC_SR_BSYF_SHIFT
#define DSPI_SR_BSYF_WIDTH                   DSPI_MSC_SR_BSYF_WIDTH
#define DSPI_SR_BSYF(x)                      DSPI_MSC_SR_BSYF(x)

#define DSPI_SR_TFFF_MASK                    DSPI_MSC_SR_TFFF_MASK
#define DSPI_SR_TFFF_SHIFT                   DSPI_MSC_SR_TFFF_SHIFT
#define DSPI_SR_TFFF_WIDTH                   DSPI_MSC_SR_TFFF_WIDTH
#define DSPI_SR_TFFF(x)                      DSPI_MSC_SR_TFFF(x)

#define DSPI_SR_DSITCF_MASK                  DSPI_MSC_SR_DSITCF_MASK
#define DSPI_SR_DSITCF_SHIFT                 DSPI_MSC_SR_DSITCF_SHIFT
#define DSPI_SR_DSITCF_WIDTH                 DSPI_MSC_SR_DSITCF_WIDTH
#define DSPI_SR_DSITCF(x)                    DSPI_MSC_SR_DSITCF(x)

#define DSPI_SR_EOQF_MASK                    DSPI_MSC_SR_EOQF_MASK
#define DSPI_SR_EOQF_SHIFT                   DSPI_MSC_SR_EOQF_SHIFT
#define DSPI_SR_EOQF_WIDTH                   DSPI_MSC_SR_EOQF_WIDTH
#define DSPI_SR_EOQF(x)                      DSPI_MSC_SR_EOQF(x)

#define DSPI_SR_SPITCF_MASK                  DSPI_MSC_SR_SPITCF_MASK
#define DSPI_SR_SPITCF_SHIFT                 DSPI_MSC_SR_SPITCF_SHIFT
#define DSPI_SR_SPITCF_WIDTH                 DSPI_MSC_SR_SPITCF_WIDTH
#define DSPI_SR_SPITCF(x)                    DSPI_MSC_SR_SPITCF(x)

#define DSPI_SR_TXRXS_MASK                   DSPI_MSC_SR_TXRXS_MASK
#define DSPI_SR_TXRXS_SHIFT                  DSPI_MSC_SR_TXRXS_SHIFT
#define DSPI_SR_TXRXS_WIDTH                  DSPI_MSC_SR_TXRXS_WIDTH
#define DSPI_SR_TXRXS(x)                     DSPI_MSC_SR_TXRXS(x)

#define DSPI_SR_TCF_MASK                     DSPI_MSC_SR_TCF_MASK
#define DSPI_SR_TCF_SHIFT                    DSPI_MSC_SR_TCF_SHIFT
#define DSPI_SR_TCF_WIDTH                    DSPI_MSC_SR_TCF_WIDTH
#define DSPI_SR_TCF(x)                       DSPI_MSC_SR_TCF(x)
/*! @} */

/*! @name RSER - DMA/Interrupt Request Select and Enable Register */
/*! @{ */

#define DSPI_RSER_DDIF_DIRS_MASK             DSPI_MSC_RSER_DDIF_DIRS_MASK
#define DSPI_RSER_DDIF_DIRS_SHIFT            DSPI_MSC_RSER_DDIF_DIRS_SHIFT
#define DSPI_RSER_DDIF_DIRS_WIDTH            DSPI_MSC_RSER_DDIF_DIRS_WIDTH
#define DSPI_RSER_DDIF_DIRS(x)               DSPI_MSC_RSER_DDIF_DIRS(x)

#define DSPI_RSER_CMDFFF_DIRS_MASK           DSPI_MSC_RSER_CMDFFF_DIRS_MASK
#define DSPI_RSER_CMDFFF_DIRS_SHIFT          DSPI_MSC_RSER_CMDFFF_DIRS_SHIFT
#define DSPI_RSER_CMDFFF_DIRS_WIDTH          DSPI_MSC_RSER_CMDFFF_DIRS_WIDTH
#define DSPI_RSER_CMDFFF_DIRS(x)             DSPI_MSC_RSER_CMDFFF_DIRS(x)

#define DSPI_RSER_RFDF_DIRS_MASK             DSPI_MSC_RSER_RFDF_DIRS_MASK
#define DSPI_RSER_RFDF_DIRS_SHIFT            DSPI_MSC_RSER_RFDF_DIRS_SHIFT
#define DSPI_RSER_RFDF_DIRS_WIDTH            DSPI_MSC_RSER_RFDF_DIRS_WIDTH
#define DSPI_RSER_RFDF_DIRS(x)               DSPI_MSC_RSER_RFDF_DIRS(x)

#define DSPI_RSER_RFDF_RE_MASK               DSPI_MSC_RSER_RFDF_RE_MASK
#define DSPI_RSER_RFDF_RE_SHIFT              DSPI_MSC_RSER_RFDF_RE_SHIFT
#define DSPI_RSER_RFDF_RE_WIDTH              DSPI_MSC_RSER_RFDF_RE_WIDTH
#define DSPI_RSER_RFDF_RE(x)                 DSPI_MSC_RSER_RFDF_RE(x)

#define DSPI_RSER_TFIWF_RE_MASK              DSPI_MSC_RSER_TFIWF_RE_MASK
#define DSPI_RSER_TFIWF_RE_SHIFT             DSPI_MSC_RSER_TFIWF_RE_SHIFT
#define DSPI_RSER_TFIWF_RE_WIDTH             DSPI_MSC_RSER_TFIWF_RE_WIDTH
#define DSPI_RSER_TFIWF_RE(x)                DSPI_MSC_RSER_TFIWF_RE(x)

#define DSPI_RSER_RFOF_RE_MASK               DSPI_MSC_RSER_RFOF_RE_MASK
#define DSPI_RSER_RFOF_RE_SHIFT              DSPI_MSC_RSER_RFOF_RE_SHIFT
#define DSPI_RSER_RFOF_RE_WIDTH              DSPI_MSC_RSER_RFOF_RE_WIDTH
#define DSPI_RSER_RFOF_RE(x)                 DSPI_MSC_RSER_RFOF_RE(x)

#define DSPI_RSER_DDIF_RE_MASK               DSPI_MSC_RSER_DDIF_RE_MASK
#define DSPI_RSER_DDIF_RE_SHIFT              DSPI_MSC_RSER_DDIF_RE_SHIFT
#define DSPI_RSER_DDIF_RE_WIDTH              DSPI_MSC_RSER_DDIF_RE_WIDTH
#define DSPI_RSER_DDIF_RE(x)                 DSPI_MSC_RSER_DDIF_RE(x)

#define DSPI_RSER_SPEF_RE_MASK               DSPI_MSC_RSER_SPEF_RE_MASK
#define DSPI_RSER_SPEF_RE_SHIFT              DSPI_MSC_RSER_SPEF_RE_SHIFT
#define DSPI_RSER_SPEF_RE_WIDTH              DSPI_MSC_RSER_SPEF_RE_WIDTH
#define DSPI_RSER_SPEF_RE(x)                 DSPI_MSC_RSER_SPEF_RE(x)

#define DSPI_RSER_DPEF_RE_MASK               DSPI_MSC_RSER_DPEF_RE_MASK
#define DSPI_RSER_DPEF_RE_SHIFT              DSPI_MSC_RSER_DPEF_RE_SHIFT
#define DSPI_RSER_DPEF_RE_WIDTH              DSPI_MSC_RSER_DPEF_RE_WIDTH
#define DSPI_RSER_DPEF_RE(x)                 DSPI_MSC_RSER_DPEF_RE(x)

#define DSPI_RSER_CMDTCF_RE_MASK             DSPI_MSC_RSER_CMDTCF_RE_MASK
#define DSPI_RSER_CMDTCF_RE_SHIFT            DSPI_MSC_RSER_CMDTCF_RE_SHIFT
#define DSPI_RSER_CMDTCF_RE_WIDTH            DSPI_MSC_RSER_CMDTCF_RE_WIDTH
#define DSPI_RSER_CMDTCF_RE(x)               DSPI_MSC_RSER_CMDTCF_RE(x)

#define DSPI_RSER_TFFF_DIRS_MASK             DSPI_MSC_RSER_TFFF_DIRS_MASK
#define DSPI_RSER_TFFF_DIRS_SHIFT            DSPI_MSC_RSER_TFFF_DIRS_SHIFT
#define DSPI_RSER_TFFF_DIRS_WIDTH            DSPI_MSC_RSER_TFFF_DIRS_WIDTH
#define DSPI_RSER_TFFF_DIRS(x)               DSPI_MSC_RSER_TFFF_DIRS(x)

#define DSPI_RSER_TFFF_RE_MASK               DSPI_MSC_RSER_TFFF_RE_MASK
#define DSPI_RSER_TFFF_RE_SHIFT              DSPI_MSC_RSER_TFFF_RE_SHIFT
#define DSPI_RSER_TFFF_RE_WIDTH              DSPI_MSC_RSER_TFFF_RE_WIDTH
#define DSPI_RSER_TFFF_RE(x)                 DSPI_MSC_RSER_TFFF_RE(x)

